In [3]:
import pandas as pd
#empty dataframe
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
emp=pd.Series(['Parker','John','smith','William'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\nSeries to data frame\n")
print(result)

Series to data frame

       Emp   ID
0   Parker  102
1     John  107
2    smith  109
3  William  114

In [23]:
#adding new column
print("\n adding new column:\n")
result['Age']=pd.Series([35,24,40,38])
print(result)

 adding new column:

       Emp   ID  Age
0   Parker  102   35
1     John  107   24
2    smith  109   40
3  William  114   38

In [24]:
#deleting column
print("\n Deleting one colunm:\n")
del result['Age']
print(result)

 Deleting one colunm:

       Emp   ID
0   Parker  102
1     John  107
2    smith  109
3  William  114

In [27]:
#extracting 3rd row
print("\n Extracting third row:\n")
print(result.loc[2])

 Extracting third row:

Emp    smith
ID       109
Name: 2, dtype: object

In [28]:
#slicing
print("\n slice rows:\n",result[1:3])

 slice rows:
      Emp   ID
1   John  107
2  smith  109

In [31]:
d2=pd.DataFrame([['Dale',123],['Mark',143]],columns=['Emp','ID'])
result=pd.concat([result,d2],ignore_index=True)
print("\nAdding new row values:\n",result)

Adding new row values:
        Emp   ID
0   Parker  102
1     John  107
2    smith  109
3  William  114
4     Dale  123
5     Mark  143
6     Dale  123
7     Mark  143

In [32]:
print("\nDeleting particular row:\n",result.drop(1))

Deleting particular row:
        Emp   ID
0   Parker  102
2    smith  109
3  William  114
4     Dale  123
5     Mark  143
6     Dale  123
7     Mark  143